DeviceProcessEvents
| where FileName in~ ("powershell.exe", "powershell_ise.exe")
| where ProcessCommandLine has "Set-MpPreference"
| where ProcessCommandLine has_any ("-DisableIntrusionPreventionSystem", "-DisableIOAVProtection", "-DisableRealtimeMonitoring")
